02_RQ/01_SH_SSC/05_性能采集优化/04_数据准备/02_数据准备总结/01_B接口性能测试[currentmonitor-binterclient]/jmeter性能脚本/bak/05_服务上跑/B_current/HTTP请求.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="测试计划" enabled="true">
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义的变量">
        <collectionProp name="Arguments.arguments">
          <elementProp name="NAMESPACE" elementType="Argument">
            <stringProp name="Argument.name">NAMESPACE</stringProp>
            <stringProp name="Argument.value">alauda</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="head_token" elementType="Argument">
            <stringProp name="Argument.name">head_token</stringProp>
            <stringProp name="Argument.value">7ccc1a4a79d37ebb2c992b7c8c4dac10</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="head_username" elementType="Argument">
            <stringProp name="Argument.name">head_username</stringProp>
            <stringProp name="Argument.value">alauda</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="cookie" elementType="Argument">
            <stringProp name="Argument.name">cookie</stringProp>
            <stringProp name="Argument.value">SESSION=YjYxNWRjZDktY2FiYy00YjFkLWI1ZDAtMTE4NjU2ZDhkNDA5; JSESSIONID=C8884F7A7C7B3FD14961B09A1EA2684D</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="低压直流配电_1000并发" enabled="false">
        <stringProp name="TestPlan.comments">性能采集机房10_200快1-FSU设备性能采集_quickly1-5</stringProp>
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV 数据文件设置" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">./data/data1000.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">true</boolProp>
          <stringProp name="variableNames">deviceId,deviceName,roomName</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP信息头管理器" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">content-type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">head_token</stringProp>
              <stringProp name="Header.value">${head_token}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">head_username</stringProp>
              <stringProp name="Header.value">${head_username}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">cookie</stringProp>
              <stringProp name="Header.value">${cookie}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP请求默认值" enabled="true">
          <stringProp name="HTTPSampler.domain">10.1.203.120</stringProp>
          <stringProp name="HTTPSampler.port">9081</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/spider/web/v1/currentmonitor/getMeasureVal</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </ConfigTestElement>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="低压直流配电_1000台并发" enabled="true">
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${requestBody}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 预处理程序" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">false</stringProp>
            <stringProp name="script">import groovy.json.JsonBuilder
import groovy.json.JsonOutput

// ========== 防御性变量获取 ==========
def deviceId = vars.get(&apos;deviceId&apos;)?.trim()
def deviceName = vars.get(&apos;deviceName&apos;)?.trim() ?: &quot;UnknownDevice&quot;
def roomName = vars.get(&apos;roomName&apos;)?.trim() ?: &quot;UnknownRoom&quot;
def namespace = vars.get(&apos;NAMESPACE&apos;)?.trim() ?: &quot;default&quot;

// 严格校验
if (!deviceId) {
    def errorMsg = &quot;&quot;&quot;
    ${&apos;=&apos;*50}
    ❌ deviceId变量为空或不存在！
    📋 可用变量列表: ${vars.getVariableNames()?.sort()?.join(&apos;, &apos;)}
    💡 请检查：
       1. CSV Data Set Config是否在JSR223之前
       2. 变量名是否拼写错误
       3. CSV文件路径是否正确
    ${&apos;=&apos;*50}
    &quot;&quot;&quot;
    log.error(errorMsg)
    throw new IllegalArgumentException(&quot;deviceId不能为空，终止测试！&quot;)
}

log.info(&quot;✅ 变量加载成功: deviceId=${deviceId}, deviceName=${deviceName}, roomName=${roomName}&quot;)

// ========== 构建请求体 ==========
def metrics = [
    [meteId: &quot;6200400004301000001&quot;, meteCode: &quot;004301&quot;, meteName: &quot;直流电压&quot;, unit: &quot;V&quot;, index: 1],
    [meteId: &quot;6200400004302000001&quot;, meteCode: &quot;004302&quot;, meteName: &quot;直流电流&quot;, unit: &quot;A&quot;, index: 2],
    [meteId: &quot;6200400004303000001&quot;, meteCode: &quot;004303&quot;, meteName: &quot;分路XX输出电流&quot;, unit: &quot;A&quot;, index: 3],
    [meteId: &quot;6200400004304000001&quot;, meteCode: &quot;004304&quot;, meteName: &quot;直流功率&quot;, unit: &quot;kW&quot;, index: 4]
]

def dataArray = metrics.collect { metric -&gt;
    [
        rowNum: 0,
        deviceName: deviceName,
        deviceId: deviceId,
        meteId: metric.meteId,
        meteCode: metric.meteCode,
        meteKind: 1,
        meteName: metric.meteName,
        meteNo: 0,
        unit: metric.unit,
        alertLevel: 0,
        deviceType: 4,
        deviceTypeName: &quot;低压直流配电&quot;,
        roomName: roomName,
        meteType: 1,
        index: metric.index,
        isEdit: false,
        meteKindName: &quot;遥测&quot;,
        alertLevelName: &quot;正常&quot;
    ]
}

def requestBody = [
    data: dataArray,
    type: &quot;device&quot;,
    namespace: namespace
]

// ========== 写入并验证 ==========
def jsonStr = JsonOutput.toJson(requestBody)
vars.put(&apos;requestBody&apos;, jsonStr)

// 双重验证
def verify = vars.get(&apos;requestBody&apos;)
if (!verify) {
    throw new RuntimeException(&quot;变量写入失败！vars.put()未生效&quot;)
}

log.info(&quot;&quot;&quot;
${&apos;=&apos;*50}
✅ requestBody写入成功！
📏 长度: ${jsonStr.length()} 字符
🔍 变量验证: ${verify.take(100)}...
${&apos;=&apos;*50}
&quot;&quot;&quot;)

// ========== 调试：保存到文件（可选）==========
// new File(&apos;debug_requestBody.json&apos;).text = jsonStr</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="同步定时器" enabled="false">
            <intProp name="groupSize">1000</intProp>
            <longProp name="timeoutInMs">500</longProp>
          </SyncTimer>
          <hashTree/>
        </hashTree>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="响应断言" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">200</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
          <intProp name="Assertion.test_type">2</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="查看结果树" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="聚合报告" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Transactions per Second" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">1000</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP请求" enabled="true">
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup guiclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroupGui" testclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup" testname="低压交流配电_1000并发" enabled="false">
        <elementProp name="ThreadGroup.main_controller" elementType="com.blazemeter.jmeter.control.VirtualUserController"/>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="TargetLevel">80</stringProp>
        <stringProp name="RampUp">0</stringProp>
        <stringProp name="Steps">0</stringProp>
        <stringProp name="Hold">10080</stringProp>
        <boolProp name="same_user_on_next_iteration">false</boolProp>
        <stringProp name="Unit">M</stringProp>
        <stringProp name="TestPlan.comments">50qps/s</stringProp>
      </com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="线程组">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV 数据文件设置">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">./data/data10001.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">true</boolProp>
          <stringProp name="variableNames">deviceName,deviceID,meteID,meteCode,meteKind,meteName,meteNo,deviceType,deviceTypeName,roomName,meteType,meteKindName</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP信息头管理器" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">content-type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">head_token</stringProp>
              <stringProp name="Header.value">${head_token}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">head_username</stringProp>
              <stringProp name="Header.value">${head_username}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">cookie</stringProp>
              <stringProp name="Header.value">${cookie}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP请求默认值" enabled="true">
          <stringProp name="HTTPSampler.domain">10.1.203.120</stringProp>
          <stringProp name="HTTPSampler.port">9081</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/spider/web/v1/currentmonitor/getMeasureVal</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </ConfigTestElement>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP请求" enabled="true">
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;data&quot;:[&#xd;
	{&quot;rowNum&quot;:0,&#xd;
	&quot;deviceName&quot;:${deviceName},&#xd;
	&quot;deviceId&quot;:${deviceID},&#xd;
	&quot;meteId&quot;:${meteID},&#xd;
	&quot;meteCode&quot;:${meteCode},&#xd;
	&quot;meteKind&quot;:${meteKind},&#xd;
	&quot;meteName&quot;:${meteName},&#xd;
	&quot;meteNo&quot;:${meteNo},&#xd;
	&quot;unit&quot;:&quot;kV&quot;,&#xd;
	&quot;alertLevel&quot;:0,&#xd;
	&quot;deviceType&quot;:${deviceType},&#xd;
	&quot;deviceTypeName&quot;:${deviceTypeName},&#xd;
	&quot;roomName&quot;:${roomName},&#xd;
	&quot;meteType&quot;:${meteType},&#xd;
	&quot;index&quot;:1,&#xd;
	&quot;isEdit&quot;:false,&#xd;
	&quot;meteKindName&quot;:${deviceID},&#xd;
	&quot;alertLevelName&quot;:&quot;正常&quot;}&#xd;
],&#xd;
&quot;type&quot;:&quot;device&quot;,&#xd;
&quot;namespace&quot;:&quot;alauda&quot;}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="查看结果树" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>